Autodesk.Revit.DB.ModelCurve.ChangeToReferenceLine
Changes this curve to a reference curve.

Autodesk.Revit.DB.ModelCurve.IsReferenceLine
Indicates if this curve is a reference curve.

Autodesk.Revit.DB.ModelCurve.TrussCurveType
The truss curve type of this model curve.
Remarks: This property is applicable only to curves in Truss families.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown when the assigned value for TrussCurveType is invalid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when attempting to set this property to a curve not in a truss family.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when attempting to change truss curves to NonTrussCurve, or when
the truss curve type may not be applied to curves of this shape (webs must be linear, and chords must be linear or arc).

Autodesk.Revit.DB.ModelCurve.Subcategory
The subcategory.
Remarks: If the family category is non-cuttable, the subcategory can be
set to be the family category or one of its subcategories.
If the family category is cuttable, the subcategory can be set as the graphics
styles of the family category, its subcategories, or the invisible lines graphics style.

Autodesk.Revit.DB.ModelCurve.SetVisibility(Autodesk.Revit.DB.FamilyElementVisibility)
Sets the visibility for the model curve in a family document.
Remarks: The visibility of the model curve geometry can be changed for different
types of views and detail levels in the family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when visibility is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed, or the model curve is in a project document.

Autodesk.Revit.DB.ModelCurve.GetVisibility
Gets the visibility for the model curve in a family document.
Returns: A copy of visibility settings for the model curve in a family document.

Autodesk.Revit.DB.ModelCurve
A model element that exists in 3D space and is visible in all views of a Revit project.